In [1]:
import numpy as np
import pandas as pd
from datetime import *
import math
import json

In [2]:
data = pd.read_csv("doctors.csv")

In [3]:
tim = datetime.now().time().strftime('%H:%M')
tim = datetime.strptime(tim, "%H:%M").time()
print(tim)

05:56:00

In [4]:
data

,doctor_id,doctor_name,specialization,free_from,doctor_to,hosp_id,latitude,longitude
0,963,Akshat B,Gynacologist,12:00,17:00,632014,23.0343,182.3453
1,741,Banana Prasad,Psychiatrist,17:30,23:50,632014,345.2200,1002.4322
2,623,ABC,Psychiatrist,22:00,1:00,632014,220.0000,8.0000
3,428,DEF,Psychiatrist,20:30,23:30,632014,220.0000,8.0000
4,341,GHI,Psychiatrist,00:30,10:00,632014,344.0000,222.0000

In [6]:
id = data[data['specialization'] == input("Enter the specialization: ")][['free_from', 'doctor_to', 'doctor_id', 'latitude', 'longitude']]
id

Enter the specialization: Psychiatrist

  free_from doctor_to  doctor_id  latitude  longitude
1     17:30     23:50        741    345.22  1002.4322
2     22:00      1:00        623    220.00     8.0000
3     20:30     23:30        428    220.00     8.0000
4     00:30     10:00        341    344.00   222.0000

In [7]:
temp = id[['free_from', 'doctor_to']].apply(lambda x: [datetime.strptime(i, '%H:%M').time() for i in x])

In [8]:
temp

  free_from doctor_to
1  17:30:00  23:50:00
2  22:00:00  01:00:00
3  20:30:00  23:30:00
4  00:30:00  10:00:00

In [9]:
id

  free_from doctor_to  doctor_id  latitude  longitude
1     17:30     23:50        741    345.22  1002.4322
2     22:00      1:00        623    220.00     8.0000
3     20:30     23:30        428    220.00     8.0000
4     00:30     10:00        341    344.00   222.0000

In [10]:
result = pd.concat([id[['doctor_id', 'latitude', 'longitude']], temp], axis = 1, join_axes = [id.index])

In [11]:
result

   doctor_id  latitude  longitude free_from doctor_to
1        741    345.22  1002.4322  17:30:00  23:50:00
2        623    220.00     8.0000  22:00:00  01:00:00
3        428    220.00     8.0000  20:30:00  23:30:00
4        341    344.00   222.0000  00:30:00  10:00:00

In [12]:
result2 = result[tim > result['free_from']]
result2 = result2[tim < result['doctor_to']]

/home/hritik/.local/lib/python3.6/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [13]:
result2

   doctor_id  latitude  longitude free_from doctor_to
4        341     344.0      222.0  00:30:00  10:00:00

In [14]:
lat = 370
long = 450

In [15]:
Min = 99999999999999999
for index, i in result2.iterrows():
    dist = math.sqrt((i[1] - lat)**2 + (i[2] - long)**2)
    print(dist)
    if dist < Min:
        min_index = i[0]
        Min = dist
print(min_index)

229.47766775876036
341

In [16]:
df = data[data['doctor_id'] == min_index][['doctor_id', 'doctor_name', 'hosp_id']]
df

   doctor_id doctor_name  hosp_id
4        341         GHI   632014